# Task 2----------------------------------------------------------------
print('Задание 2: посчитай сколько нужно продуктов', end='\n' * 2)
cook_book = [
  ['салат',
      [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
      ]
  ],
  ['пицца',  
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],  
      ]
  ],
  ['маргарита',
      [
        ['текила', 50, 'мл.'],
        ['апельсиновый ликер ТриплСек', 20, 'мл.'],
        ['лаймовый фрещ', 15, 'мл.'],
      ]
  ]
]
person = int(input('Введите количество гостей: ').strip())
# person = 5
for dish, kit in cook_book:
    print(dish.capitalize(), ':', sep='')
    for item, weight, measure in kit:
      print(f'{item}, {weight * person}{measure}')
    print()








    
